InformationRegisters/СведенияОФизическихЛицахУчастникахВОВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОФизическихЛицахУчастникахВОВ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииФизическихЛицУчастниковВОВ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КатегорииФизическихЛицУчастниковВОВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КатегорииФизическихЛицУчастниковВОВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УчастникВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицоПриравненноеКУчастникамВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицоПриравненныеКИнвалидамВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетераныБоевыхДействийНаТерриторииДругихГосударств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетераныТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКатегорияЛицПриравненныхКУчастникамВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвалидВОВ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОФизическихЛицахУчастникахВОВ/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаСведенийВОВ Из ЭтотОбъект Цикл
		
		Если СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизическихЛицУчастниковВОВ.ИнвалидВОВ
			И СтрокаСведенийВОВ.Период >= Дата(2020, 5, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Категория ""Инвалиды ВОВ (до мая 2020)"" используется до мая 2020 года'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;

		ИначеЕсли (СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизическихЛицУчастниковВОВ.ВетераныБоевыхДействийНаТерриторииДругихГосударств
			ИЛИ СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизическихЛицУчастниковВОВ.ВетераныТруда)
			И СтрокаСведенийВОВ.Период < Дата(2020, 5, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Категории ""Ветераны боевых действий на территории других государств"", ""Ветераны труда"" используются с мая 2020 года'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;

		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
